<?php

/* ------------------------------------------------------------------

共通

------------------------------------------------------------------ */

$_ = function($s){return $s;};


/* ------------------------------------------------------------------
配列データの表示
------------------------------------------------------------------ */
function e($data, $key){
	if(isset($data) && isset($data[$key]) && $data[$key]!=""){
		echo get_escape_decode($data[$key]);
	}
}

/* ------------------------------------------------------------------
配列データの取得
------------------------------------------------------------------ */
function g($data, $key){
	$res = "";
	if(isset($data) && isset($data[$key]) && $data[$key]!=""){
		$res = $data[$key];
	}
	return $res;
}

/* ------------------------------------------------------------------
配列データの取得
------------------------------------------------------------------ */
function brbr(){
	echo "<br><br>";
}

/* ------------------------------------------------------------------
キャッシュ削除
------------------------------------------------------------------ */
function get_file_mtime($file){
	$date_time = "29990101000000";
	if (file_exists($file)) {
		$mtime = filemtime($file);
		$date_time = date('YmdHis', $mtime);
	}
	return $date_time;
}

/* ------------------------------------------------------------------
カレントURLの取得
------------------------------------------------------------------ */
function get_current_url(){
	if(isset($_SERVER["REQUEST_SCHEME"])){
		$current_url = $_SERVER["REQUEST_SCHEME"]."://".$_SERVER["HTTP_HOST"].$_SERVER["REQUEST_URI"];
	}else{
		$current_url = DOMAIN.$_SERVER["REQUEST_URI"];
	}
	return $current_url;
}

/* ------------------------------------------------------------------
URL取得
------------------------------------------------------------------ */
function get_current_script(){
	$current_script = substr($_SERVER["SCRIPT_NAME"], 1);
	$current_script =  DOC_ROOT.$current_script;
	return $current_script;
}

/* ------------------------------------------------------------------
POST、　GETの取得
------------------------------------------------------------------ */
function get_data($data, $name, $default=""){
	$res = $default;
	if(isset($data[$name])){
		$res = $data[$name];
	}
	return $res;
}

/* ------------------------------------------------------------------
データのHTMLCHARのエスケープ処理
------------------------------------------------------------------ */
function get_escape_datas($data){
	foreach ($data as $key => $value) {
		$data[$key] = get_escape($value);
	}
	return $data;
}

/* ------------------------------------------------------------------
HTMLCHARのエスケープ処理
------------------------------------------------------------------ */
function get_escape($data){
	$data = htmlspecialchars(trim($data));
	return $data;
}

/* ------------------------------------------------------------------
HTMLCHARのエスケープ処理
------------------------------------------------------------------ */
function get_escape_decode($data){
	$data = htmlspecialchars_decode(trim($data));
	return $data;
}


/* ------------------------------------------------------------------
小数点1桁
------------------------------------------------------------------ */
function formatH($data){
	$res = $data;
	if(is_null($data) || ((int) $data)==0){
		$res = "-";
	}
	return $res;
}

/* ------------------------------------------------------------------

コンテンツ系

------------------------------------------------------------------ */


?>
